read_liberty -lib ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_AO_RVT_TT_ccs_211010.lib.gz
read_liberty -lib ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_CKINVDC_RVT_TT_ccs_211010.lib.gz
read_liberty -lib ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_INVBUF_RVT_TT_ccs_211010.lib.gz
read_liberty -lib ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_OA_RVT_TT_ccs_211010.lib.gz
read_liberty -lib ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_SEQ_RVT_TT_ccs_211010.lib.gz
read_liberty -lib ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_SIMPLE_RVT_TT_ccs_211010.lib

read_verilog_file_list -f ./syn/asap7/scripts/file_list.txt
synth -top mt_cpu
flatten

dfflibmap -liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_SEQ_RVT_TT_ccs_211010.lib.gz
abc \
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_AO_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_CKINVDC_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_INVBUF_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_OA_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_SEQ_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_SIMPLE_RVT_TT_ccs_211010.lib

clean
write_verilog -noattr -noexpr -nohex -nodec ./syn/asap7/reports/mt_cpu.nl.v
tee -o ./syn/asap7/reports/area.txt stat \
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_AO_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_CKINVDC_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_INVBUF_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_OA_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_SEQ_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_SIMPLE_RVT_TT_ccs_211010.lib

stat \
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_AO_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_CKINVDC_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_INVBUF_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_OA_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_SEQ_RVT_TT_ccs_211010.lib.gz
-liberty ~/asap7sc6t_26/LIB/CCS/TT/asap7sc6t_SIMPLE_RVT_TT_ccs_211010.lib
