read_liberty -lib ~/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib
read_liberty -lib ~/git_stuff/internship/syn/sram/sram_128x32/out/sram_128x32_TT.lib
read_verilog_file_list -f ./syn/scripts/file_list.txt
synth -top mt_cpu
flatten
dfflibmap -liberty ~/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty ~/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib
clean
write_verilog -noattr -noexpr -nohex -nodec ./syn/reports/mt_cpu.nl.v
tee -o ./syn/reports/area.txt stat -liberty ~/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib -liberty ~/git_stuff/internship/syn/sram/sram_128x32/out/sram_128x32_TT.lib -tech cmos
